{
  "backend/main.mo": "Main Motoko actor implementing personal finance management with transactions, recurring transactions, budget limits, and periodic execution of recurring transactions. Provides query functions for expanded income/expense categories and CRUD operations for all financial entities.",
  "backend/migration.mo": "Migration module defining old and new actor state types and a run function to migrate from the old schema (without recurring transactions) to the new schema (with recurring transactions support).",
  "feature_evidence.json": "Feature evidence report documenting implemented features for recurring transactions management page, add/edit modal, notification system for transactions and balance thresholds, and React Query hooks with high confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, hooks, and utilities including dashboard, transaction management, budget tracking, recurring transactions, notifications, charts, filters, and CSV export functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including background, foreground, primary, secondary, charts, sidebar, and borders.",
  "frontend/index.html": "HTML entry point for the MoneyFlow application with viewport meta tag and root div mounting point for React.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, protected routes for authenticated pages (Dashboard, Transactions, Budget, Summary, Recurring), theme provider, navigation layout, and footer with caffeine.ai attribution.",
  "frontend/src/components/AddTransactionModal.tsx": "Modal dialog for adding new income or expense transactions with category selection, amount input, and budget notification checks. Integrates with transaction and budget notification hooks to validate and save transactions.",
  "frontend/src/components/BalanceDisplay.tsx": "Displays three cards showing total income, total expenses, and current balance with icons and color-coded styling. Uses the financial summary hook to fetch and display aggregated financial data.",
  "frontend/src/components/BudgetLimitForm.tsx": "Form component for creating budget limits by selecting an expense category and setting a monthly limit amount. Submits data via the add budget limit mutation hook.",
  "frontend/src/components/BudgetProgressCard.tsx": "Card displaying budget progress for a category with a progress bar, spent/limit amounts, and delete functionality. Color-codes the display based on percentage of budget used (red/orange/yellow/green).",
  "frontend/src/components/EditTransactionModal.tsx": "Modal dialog for editing existing transactions, allowing updates to category, amount, and description. Checks budget notifications when expense amounts increase.",
  "frontend/src/components/ExpenseChart.tsx": "Pie chart visualization of expenses by category using Recharts library. Displays total expenses and percentage breakdown with color-coded segments.",
  "frontend/src/components/ExpensePrediction.tsx": "Card component displaying predicted expenses for the next month based on historical data. Shows total predicted amount and per-category breakdown using the expense prediction hook.",
  "frontend/src/components/FinancialHealthScore.tsx": "Displays a circular progress chart showing financial health score calculated as savings rate (income minus expenses divided by income), with color-coded status labels (Excellent, Good, Fair, Poor) and trend icons.",
  "frontend/src/components/FinancialSummary.tsx": "Shows financial summary with total income, expenses, and net balance for selected period (month/year/custom), includes a bar chart visualization and custom date range picker for flexible reporting.",
  "frontend/src/components/IncomeChart.tsx": "Renders a donut pie chart visualizing income distribution across categories with color-coded segments, tooltips showing amounts, and legend displaying category percentages.",
  "frontend/src/components/Navigation.tsx": "Main navigation component with responsive design featuring desktop horizontal menu and mobile sheet drawer, includes links to Dashboard, Transactions, Budget, Summary, and Recurring pages plus theme toggle and logout button.",
  "frontend/src/components/RecurringTransactionModal.tsx": "Dialog modal for creating and editing recurring transactions with fields for type, category, amount, description, frequency, start/end dates, supporting both income and expense types with dynamic category selection.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with smooth rotation transitions.",
  "frontend/src/components/TransactionFilters.tsx": "Filter panel with dropdowns and inputs for filtering transactions by type, category, date range, and amount, includes a reset button to clear all filters.",
  "frontend/src/components/TransactionList.tsx": "Displays a sorted list of transactions with category icons, amounts, dates, and edit/delete actions. Includes a modal for editing transactions and handles empty states.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBudgetNotifications.ts": "Monitors budget limits against current month expenses and displays toast notifications when budgets are exceeded or approaching 90% threshold.",
  "frontend/src/hooks/useExpensePrediction.ts": "Analyzes the last 3 months of expenses to predict future spending by category, calculating monthly averages and total predicted expenses.",
  "frontend/src/hooks/useFinancialSummary.ts": "Calculates and returns total income, total expenses, and current balance from all transactions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and session lifecycle with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating transactions, budget limits, categories, and recurring transactions with toast notifications and cache invalidation.",
  "frontend/src/hooks/useRecurringTransactionNotifications.ts": "Detects newly executed recurring transactions by tracking transaction IDs and displays toast notifications with navigation to the transactions page.",
  "frontend/src/hooks/useTransactionFilters.ts": "Provides filtering logic for transactions by type, category, date range, and amount with memoized results.",
  "frontend/src/hooks/useTransactionNotifications.ts": "Monitors new transactions and displays toast notifications for significant income (>10k), large expenses (>5k), and low balance warnings (<1k).",
  "frontend/src/index.css": "Global CSS file that imports fonts (Inter and Outfit), configures Tailwind layers, defines CSS custom properties for light/dark theme colors using OKLCH color space with teal/emerald theme, and includes custom scrollbar and progress bar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/BudgetPage.tsx": "Budget management page that displays budget limits by category, calculates current month spending against limits, and provides UI to add new budget limits with a form toggle.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing financial overview with balance display, income/expense charts, financial health score, expense predictions, and a button to add transactions; also processes recurring transactions on load and enables notifications.",
  "frontend/src/pages/LoginPage.tsx": "Login page with centered card UI displaying app logo, description, and Internet Identity authentication button with loading state.",
  "frontend/src/pages/RecurringTransactionsPage.tsx": "Page for managing recurring transactions with list view, add/edit/delete/toggle functionality, displays frequency, next due date calculations, and confirmation dialogs for deletion.",
  "frontend/src/pages/SummaryPage.tsx": "Financial summary page with period selector (month/year/custom) that displays FinancialSummary component for viewing performance over time.",
  "frontend/src/pages/TransactionsPage.tsx": "Transactions list page with filtering capabilities, CSV export functionality, and add transaction modal; displays all transactions with applied filters.",
  "frontend/src/utils/csvExport.ts": "Utility function that exports transaction data to CSV format with headers (Date, Type, Category, Amount, Description) and triggers browser download with timestamped filename.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH variables, container settings, extended theme with custom animations, border radius, fonts (Inter/Outfit), and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file defining a full-stack personal finance management platform with React/TypeScript frontend, Node.js/Express backend, MongoDB database, JWT authentication, and income/expense tracking features. Contains architectural notes, existing features list, known issue with chart displaying '0' over income visualization, and deployment configuration for MongoDB Atlas and Render/Vercel."
}